#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017,2020, 2024.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE

error.checking.results=\u5206\u6790\u7d50\u679c\u306e\u691c\u67fb\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u5206\u6790\u306e\u72b6\u6cc1\u306f {0} \u3067\u3059\u3002
error.invalid.template.file=\u30b9\u30ad\u30e3\u30f3\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u304c\u7121\u52b9\u3067\u3059\u3002
error.invalid.login.sequence.file= \u30ed\u30b0\u30a4\u30f3\u624b\u9806\u30d5\u30a1\u30a4\u30eb\u304c\u7121\u52b9\u3067\u3059\u3002
error.login.fields.automatic= \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30b9\u30ad\u30e3\u30f3\u3059\u308b\u306b\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
error.login.fields.manual= \u30ed\u30b0\u30a4\u30f3\u624b\u9806\u30d5\u30a1\u30a4\u30eb\u306e\u5f62\u5f0f\u304c\u7121\u52b9\u3067\u3059\u3002Config \u30d5\u30a1\u30a4\u30eb\u62e1\u5f35\u5b50\u306e\u307f\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002
error.login.fields.empty.manual = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30b9\u30ad\u30e3\u30f3\u3059\u308b\u306b\u306f\u3001\u30ed\u30b0\u30a4\u30f3\u624b\u9806\u30d5\u30a1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002
error.no.creds=\u5fc5\u9808\u3002 HCL AppScan on Cloud \u8cc7\u683c\u60c5\u5831\u3092<a target="_blank" href="{0}">\u8cc7\u683c\u60c5\u5831\u30da\u30fc\u30b8</a>\u306b\u8ffd\u52a0\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 
error.no.creds.ase=\u5fc5\u9808\u3002HCL AppScan Enterprise \u8cc7\u683c\u60c5\u5831\u3092<a target="_blank" href="{0}">\u8cc7\u683c\u60c5\u5831\u30da\u30fc\u30b8</a>\u306b\u8ffd\u52a0\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
error.running.scan=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30b9\u30ad\u30e3\u30f3\u306e\u5b9f\u884c\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
error.token.expired=\u8a8d\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002 <a target="_blank" href="{0}">\u8cc7\u683c\u60c5\u5831\u30da\u30fc\u30b8</a>\u3067\u3054\u4f7f\u7528\u306e\u8cc7\u683c\u60c5\u5831\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
error.noncompliant.issues=\u30b9\u30ad\u30e3\u30f3\u7d50\u679c\u306b\u306f\u9078\u629e\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u95a2\u9023\u3059\u308b\u30dd\u30ea\u30b7\u30fc\u306b\u5bfe\u3059\u308b\u975e\u6e96\u62e0\u306e\u554f\u984c\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
error.threshold.exceeded=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u7d50\u679c\u306e\u6570\u304c\u6307\u5b9a\u3055\u308c\u305f\u3057\u304d\u3044\u5024\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
error.threshold.invalid=\u7121\u52b9\u306a\u30a8\u30f3\u30c8\u30ea\u30fc\u3067\u3059\u3002 \u6574\u6570\u5024\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.malformed.url=URL {0} \u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
error.server.unavailable=AppScan on Cloud \u3078\u306e\u63a5\u7d9a\u4e2d\u306b\u3001AppScan \u30d7\u30e9\u30b0\u30a4\u30f3\u3067\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
error.mobile.analyzer=\u30e6\u30fc\u30b6\u30fc\u5165\u529b\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u30ec\u30ac\u30b7\u30fc Mobile Analyzer \u30c6\u30af\u30ce\u30ed\u30b8\u30fc\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002\u30e2\u30d0\u30a4\u30eb\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u3001Static Analyzer \u30b9\u30ad\u30e3\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
error.presence.AppScan360= \u30d7\u30ec\u30bc\u30f3\u30b9\u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002
warning.allow.intervention.AppScan360= \u30b9\u30ad\u30e3\u30f3\u8a2d\u5b9a\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093: \u4ecb\u5165\u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002
error.sca.AppScan360= HCL AppScan \u30bf\u30b9\u30af\u304c\u5931\u6557\u3057\u307e\u3057\u305f: \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\u5206\u6790 (SCA) \u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002
error.sca.ui= \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\u5206\u6790\u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002
error.allow.intervention.ui = \u30b9\u30ad\u30e3\u30f3\u4ecb\u5165\u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059
error.include.sca.ui= \u300cSCA \u3092\u542b\u3081\u308b\u300d\u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002
error.asoc.certificates.ui = \u4fe1\u983c\u3067\u304d\u306a\u3044\u63a5\u7d9a\u306e\u8a31\u53ef\u306f\u3001AppScan on Cloud \u306b\u306f\u9069\u7528\u3055\u308c\u307e\u305b\u3093\u3002
warning.asoc.certificates = \u4fe1\u983c\u3067\u304d\u306a\u3044\u63a5\u7d9a\u306e\u8a31\u53ef\u306f\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u63a5\u7d9a\u306b\u306f\u9069\u7528\u3055\u308c\u307e\u305b\u3093\u3002
error.application.empty.ui = \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30b9\u30c8\u304c\u7a7a\u3067\u3059\u3002\u30b5\u30fc\u30d3\u30b9\u63a5\u7d9a\u306e\u8cc7\u683c\u60c5\u5831\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.url.validation.ui = \u3053\u308c\u304c\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8\u30fb\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u3067\u306a\u3044\u5834\u5408\u306f\u3001\u30c9\u30e1\u30a4\u30f3\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.url.validation = \u958b\u59cb URL \u306e\u691c\u8a3c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}\u3002
error.active.subscription.validation = \u6709\u52b9\u306a {0} \u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
error.active.subscription.validation.ui = \u9078\u629e\u3057\u305f\u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7\u306e\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
error.sca.AppScan360.ui= \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\u5206\u6790\u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059.
warning.sca.ui= \u30aa\u30fc\u30d7\u30f3\u30fb\u30bd\u30fc\u30b9\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u30b9\u30ad\u30e3\u30f3\u3059\u308b\u306b\u306f\u3001\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\u5206\u6790 (SCA) \u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warning.sca= AppScan on Cloud (ASoC) \u306f\u3001SAST \u5206\u6790\u3068 SCA \u5206\u6790\u3092\u500b\u5225\u306e\u30b9\u30ad\u30e3\u30f3\u3068\u3057\u3066\u5b9f\u884c\u3059\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3057\u305f\u3002\u30aa\u30fc\u30d7\u30f3\u30fb\u30bd\u30fc\u30b9\u306e\u307f\u306e\u30b9\u30ad\u30e3\u30f3\u3092\u5b9f\u884c\u3059\u308b\u306b\u306f\u3001\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30fb\u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\u5206\u6790 (SCA) \u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warning.include.sca.AppScan360= SAST \u30b9\u30ad\u30e3\u30f3\u306e\u307f\u304c\u5b9f\u884c\u4e2d\u3067\u3059\u3002SCA \u306f\u3001AppScan on Cloud \u3067\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3042\u308a\u3001\u3053\u306e\u30b8\u30e7\u30d6\u306b\u306f\u542b\u3081\u3089\u308c\u307e\u305b\u3093\u3002
error.invalid.format.include.sca = SCA \u30b9\u30ad\u30e3\u30f3\u306b\u306f IRX \u30d5\u30a1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002\u7d9a\u884c\u3059\u308b\u306b\u306f\u3001\u6709\u52b9\u306a IRX \u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warning.sca.subscription = SCA \u30b9\u30ad\u30e3\u30f3\u306f\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u306b\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001SAST \u30b9\u30ad\u30e3\u30f3\u5b9f\u884c\u306e\u307f\u304c\u767a\u751f\u3057\u307e\u3059\u3002
error.invalid.scan.id = \u3053\u308c\u306f\u3001\u30b9\u30ad\u30e3\u30f3 ID \u306b\u4e0d\u6b63\u306a\u6587\u5b57\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u304b\u3001\u5225\u306e\u7d44\u7e54\u306e\u30b9\u30ad\u30e3\u30f3 ID \u3067\u3042\u308b\u304b\u3001\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u4e0d\u5341\u5206\u3067\u3042\u308b\u305f\u3081\u306b\u767a\u751f\u3059\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\u78ba\u8a8d\u3057\u3066\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.invalid.scan.id.application = \u9078\u629e\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u5165\u529b\u3055\u308c\u305f\u30b9\u30ad\u30e3\u30f3 ID \u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u6b63\u3057\u3044\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u78ba\u8a8d\u3057\u3001\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.invalid.scan.id.scan.type = \u9078\u629e\u3057\u305f\u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7\u304c\u3001\u5165\u529b\u3055\u308c\u305f\u30b9\u30ad\u30e3\u30f3 ID \u306e\u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7\u3068\u7570\u306a\u308a\u307e\u3059\u3002\u30b9\u30ad\u30e3\u30f3\u30fb\u30bf\u30a4\u30d7\u304c\u3001\u30b9\u30ad\u30e3\u30f3 ID \u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u3082\u306e\u3068\u4e00\u81f4\u3059\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.invalid.scan.id.git.repo = Git \u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u30fb\u30b9\u30ad\u30e3\u30f3\u306f\u3001CI/CD \u3092\u4ecb\u3057\u305f SAST \u518d\u30b9\u30ad\u30e3\u30f3\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
error.invalid.scan.id.ui = \u5165\u529b\u3055\u308c\u305f\u30b9\u30ad\u30e3\u30f3 ID \u304c\u3001\u9078\u629e\u3057\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304a\u3088\u3073\u30c6\u30af\u30ce\u30ed\u30b8\u30fc\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u6b63\u3057\u3044 ID \u3092 AppScan on Cloud/AppScan 360\u00b0 Server \u304b\u3089\u53d6\u5f97\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warning.personal.scan.rescan = \u500b\u4eba\u30b9\u30ad\u30e3\u30f3\u306f\u3001\u518d\u30b9\u30ad\u30e3\u30f3\u306b\u306f\u9069\u7528\u3067\u304d\u307e\u305b\u3093\u3002
error.empty.scan.id = \u30b9\u30ad\u30e3\u30f3 ID \u5024\u304c\u7a7a\u3067\u3059\u3002\u78ba\u8a8d\u3057\u3066\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002


analysis.running=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u5206\u6790\u306e\u5b9f\u884c\u4e2d...
authentication.success=\u6b63\u5e38\u306b\u8a8d\u8a3c\u3055\u308c\u307e\u3057\u305f\u3002
authentication.failed=\u30b5\u30fc\u30d3\u30b9\u306b\u5bfe\u3057\u3066\u8a8d\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002
need.api.key=API \u30ad\u30fc\u306e ID/\u79d8\u5bc6\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001 <a target="_blank" href="{0}">\u3053\u3061\u3089\u3067\u4f5c\u6210</a>\u3057\u3066\u304f\u3060\u3055\u3044\u3002
need_ase_api_doc=\u30ad\u30fc ID \u304a\u3088\u3073\u79d8\u5bc6\u306e\u751f\u6210\u304c\u5fc5\u8981\u3067\u3059\u3002<a target="_blank" href="{0}">\u8cc7\u683c\u60c5\u5831\u306f\u3069\u306e\u3088\u3046\u306b\u5165\u624b\u3067\u304d\u307e\u3059\u304b?</a>
logs.link=\u30b8\u30e7\u30d6 {0} \u304c\u6b63\u5e38\u306b\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002\u30b9\u30ad\u30e3\u30f3\u30fb\u30b8\u30e7\u30d6\u7d71\u8a08: {1}
check.server=\u30b9\u30ad\u30e3\u30f3\u7d50\u679c\u306e {0} \u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

label.asoc=HCL AppScan on Cloud \u8cc7\u683c\u60c5\u5831
label.ase =HCL AppScan Enterprise \u8cc7\u683c\u60c5\u5831
label.build.step=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c6\u30b9\u30c8\u306e\u5b9f\u884c
label.asebuild.step=AppScan Enterprise \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c6\u30b9\u30c8\u306e\u5b9f\u884c
label.results={0}\u7d50\u679c
label.results.trend=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u5206\u6790\u306e\u30c8\u30ec\u30f3\u30c9
label.total=\u5408\u8a08
label.critical=\u30af\u30ea\u30c6\u30a3\u30ab\u30eb
label.high=\u9ad8
label.medium=\u4e2d
label.low=\u4f4e
label.latest.report=\u6700\u65b0\u306e {0} \u30ec\u30dd\u30fc\u30c8
label.running=\u5b9f\u884c\u4e2d\u306e\u30b9\u30ad\u30e3\u30f3 {0}...
label.ase.homepage=AppScan Enterprise (ASE)
label.ase.application=AppScan Enterprise (ASE)
label.asoc.homepage=AppScan on Cloud (ASoC)
label.appscan360.homepage=AppScan 360\u00b0

option.staging=\u30b9\u30c6\u30fc\u30b8\u30f3\u30b0
option.production=\u5b9f\u52d5

option.nooptimization=\u6700\u9069\u5316\u306a\u3057
option.fast=\u9ad8\u901f
option.faster=\u3088\u308a\u9ad8\u901f
option.fastest=\u6700\u901f
