#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017,2020, 2024, 2025.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE

error.checking.results=Se ha producido un error al comprobar los resultados del an\u00e1lisis. El estado del an\u00e1lisis es {0}.
error.invalid.template.file=Archivo de plantilla o escaneo no v\u00e1lido.
error.invalid.login.sequence.file= Archivo de secuencia de inicio de sesi\u00f3n no v\u00e1lido.
error.login.fields.automatic= El nombre de usuario y la contrase\u00f1a son necesarios para analizar la aplicaci\u00f3n.
error.login.fields.manual= El formato del archivo de secuencia de inicio de sesi\u00f3n no es v\u00e1lido. Solo se admite la extensi\u00f3n del archivo de configuraci\u00f3n.
error.login.fields.empty.manual = Se requiere un archivo de secuencia de inicio de sesi\u00f3n para analizar la aplicaci\u00f3n.
error.no.creds=Necesario. Puede a\u00f1adir credenciales HCL AppScan on Cloud en la <a target="_blank" href="{0}">P\u00e1gina de credenciales</a>. 
error.no.creds.ase=Necesario. Puede a\u00f1adir las credenciales de HCL AppScan Enterprise en la <a target="_blank" href="{0}">P\u00e1gina de credenciales</a>.
error.running.scan=Error al ejecutar el escaneo de seguridad: {0}
error.token.expired=No se puede autenticar. Compruebe sus credenciales en la <a target="_blank" href="{0}">P\u00e1gina de credenciales</a>. 
error.noncompliant.issues=El resultado del escaneo contiene problemas que no cumplen las pol\u00edticas asociadas a la aplicaci\u00f3n seleccionada.
error.threshold.exceeded=El n\u00famero de resultados de seguridad supera el umbral especificado.
error.threshold.invalid=Entrada no v\u00e1lida. Especifique un valor entero.
error.malformed.url=URL con formato incorrecto {0}.
error.server.unavailable=El complemento de AppScan ha detectado un error inesperado al conectarse a AppScan on Cloud.
error.mobile.analyzer=Entrada de usuario incorrecta. La tecnolog\u00eda legacy de Mobile Analyzer ya no es compatible. Recomendamos utilizar nuestros an\u00e1lisis de Static Analyzer para aplicaciones m\u00f3viles.
error.presence.AppScan360= La opci\u00f3n de presencia solo est\u00e1 disponible en AppScan on Cloud.
warning.allow.intervention.AppScan360= Configuraci\u00f3n de an\u00e1lisis incorrecta: La opci\u00f3n de intervenci\u00f3n solo est\u00e1 disponible en AppScan on Cloud.
error.sca.AppScan360= Error en la tarea de HCL AppScan: El an\u00e1lisis de composici\u00f3n de software (SCA) solo est\u00e1 disponible en AppScan on Cloud.
error.sca.ui= El an\u00e1lisis de composici\u00f3n de software solo est\u00e1 disponible en AppScan on Cloud.
error.allow.intervention.ui = La intervenci\u00f3n durante el an\u00e1lisis solo est\u00e1 disponible en AppScan on Cloud
error.include.sca.ui= La opci\u00f3n para incluir SCA solo est\u00e1 disponible en AppScan on Cloud.
error.asoc.certificates.ui = La opci\u00f3n para permitir conexiones de no confianza no se puede usar en AppScan on Cloud.
warning.asoc.certificates = La opci\u00f3n para permitir conexiones de no confianza no se aplica a la conexi\u00f3n de este servicio.
error.application.empty.ui = La lista de aplicaciones est\u00e1 vac\u00eda. Compruebe las credenciales para la conexi\u00f3n del servicio. 
error.url.validation.ui = A menos que se trate de una red privada, compruebe su dominio.
error.url.validation = Se ha producido un error al validar la URL de inicio: {0}.
error.active.subscription.validation = No dispone de una suscripci\u00f3n a {0} v\u00e1lida.
error.active.subscription.validation.ui = No tiene ninguna suscripci\u00f3n para el tipo de an\u00e1lisis seleccionado.
error.sca.AppScan360.ui= El an\u00e1lisis de composici\u00f3n de software solo est\u00e1 disponible en AppScan on Cloud.
warning.sca.ui= Para analizar archivos de c\u00f3digo abierto, utilice el tipo de an\u00e1lisis de composici\u00f3n de software (SCA).
warning.sca= AppScan on Cloud (ASoC) ahora realiza an\u00e1lisis SAST y SCA como an\u00e1lisis independientes. Para ejecutar un an\u00e1lisis solo de c\u00f3digo abierto, utilice el tipo de an\u00e1lisis de composici\u00f3n de software (SCA).
warning.include.sca.AppScan360= Solo se est\u00e1 ejecutando el an\u00e1lisis de tipo SAST. El an\u00e1lisis SCA solo est\u00e1 disponible con AppScan on Cloud y no se incluye en este trabajo.
error.invalid.format.include.sca = Para el an\u00e1lisis SCA se necesita un archivo IRX. Proporcione la ruta a un archivo IRX v\u00e1lido para continuar.
warning.sca.subscription = Solo se ejecuta el an\u00e1lisis SAST, ya que el an\u00e1lisis SCA no est\u00e1 presente en las suscripciones activas.
error.invalid.scan.id = ID de an\u00e1lisis no v\u00e1lido: aseg\u00farese de que pertenece a su organizaci\u00f3n y que coincide con el tipo de an\u00e1lisis seleccionado.
error.invalid.scan.id.application = Desajuste de la aplicaci\u00f3n: aseg\u00farese de que la aplicaci\u00f3n seleccionada coincida con la aplicaci\u00f3n asociada al ID de an\u00e1lisis.
error.invalid.scan.id.git.repo = Los an\u00e1lisis de repositorios Git no son compatibles con las repeticiones de an\u00e1lisis SAST a trav\u00e9s de CI/CD.
warning.personal.scan.rescan = Los an\u00e1lisis personales no son aplicables a las repeticiones de an\u00e1lisis.
error.empty.scan.id = El valor del ID de an\u00e1lisis est\u00e1 vac\u00edo. Compru\u00e9belo e int\u00e9ntelo de nuevo.
warning.empty.execution.id = Falta el ID de ejecuci\u00f3n b\u00e1sico. Dado que el an\u00e1lisis se establece en incremental, se realizar\u00e1 un an\u00e1lisis completo de manera predeterminada.
error.scan.id.validation.rescan.allowed = No se permite repetir el an\u00e1lisis debido a restricciones organizativas.
error.scan.id.validation.status = El an\u00e1lisis seleccionado est\u00e1 en el estado {0}. La repetici\u00f3n de an\u00e1lisis solo se pueden realizar cuando el an\u00e1lisis est\u00e1 listo, est\u00e1 en pausa o tiene errores.
error.invalid.scan.id.ui = ID de an\u00e1lisis no v\u00e1lido o desajuste en el tipo de an\u00e1lisis.
error.invalid.scan.id.application.ui = El ID de an\u00e1lisis no coincide con la aplicaci\u00f3n seleccionada.
error.invalid.scan.id.git.repo.ui = Los an\u00e1lisis repo Git no son compatibles con las repeticiones de an\u00e1lisis SAST.
error.invalid.scan.id.rescan.allowed.ui = Repetici\u00f3n de an\u00e1lisis deshabilitada por la pol\u00edtica del administrador.
error.base.scan.empty.ui = ID de an\u00e1lisis no v\u00e1lido. Introduzca un ID de an\u00e1lisis v\u00e1lido para seleccionar un an\u00e1lisis b\u00e1sico.
error.token.authentication = No se pudo validar su ID de clave y su secreto. Compruebe e int\u00e9ntelo de nuevo.
error.scan.status.unstable= Error en una ejecuci\u00f3n de an\u00e1lisis. Consulte la p\u00e1gina de resumen de compilaci\u00f3n para ver los resultados del an\u00e1lisis correcto.
error.file.type.invalid= Tipo de archivo no v\u00e1lido. Solo se admiten los archivos {0}

analysis.running=Ejecutando el an\u00e1lisis de seguridad...
authentication.success=Autenticado satisfactoriamente.
authentication.failed=No se ha podido autenticar con el servicio.
need.api.key=\u00bfNecesita una ID de clave de API/Secreto? Cree uno <a target="_blank" href="{0}">aqu\u00ed</a>
need_ase_api_doc=Necesita generar un identificador de clave y un secreto. <a target="_blank" href="{0}"> \u00bfC\u00f3mo obtengo mis credenciales?</a>
logs.link=El trabajo {0} se ha iniciado correctamente. Estad\u00edsticas del trabajo de an\u00e1lisis: {1}
check.server=Consulte {0} para ver los resultados del an\u00e1lisis.
fail.build.check= Comprobando fallos de compilaci\u00f3n basados en la configuraci\u00f3n del an\u00e1lisis...

label.asoc=Credenciales de HCL AppScan on Cloud/HCL AppScan 360\u00b0
label.ase =Credenciales de HCL AppScan Enterprise
label.build.step=Ejecutar prueba de seguridad de AppScan on Cloud/AppScan 360\u00b0
label.asebuild.step=Ejecutar pruebas de seguridad de AppScan Enterprise
label.results={0} Resultados
label.results.trend=Tendencia de an\u00e1lisis de seguridad
label.total=Total
label.critical=Cr\u00edtico
label.high=Alta
label.medium=Media
label.low=Baja
label.latest.report=Informes {0} m\u00e1s recientes
label.running=Ejecutando escaneo {0}...
label.ase.homepage=AppScan Enterprise (ASE)
label.ase.application=AppScan Enterprise (ASE)
label.asoc.homepage=AppScan on Cloud (ASoC)
label.appscan360.homepage=AppScan 360\u00b0

option.staging=Transferencia
option.production=Producci\u00f3n

option.nooptimization=Sin optimizaci\u00f3n
option.fast=R\u00e1pida
option.faster=M\u00e1s r\u00e1pida
option.fastest=La m\u00e1s r\u00e1pida
