#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017,2020, 2024.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE

error.checking.results=Ocorreu um erro ao verificar os resultados da an\u00e1lise.O status de an\u00e1lise \u00e9 {0}.
error.invalid.template.file=Arquivo de modelo de varredura inv\u00e1lido.
error.invalid.login.sequence.file= Arquivo de sequ\u00eancia de login inv\u00e1lido.
error.login.fields.automatic= Nome de usu\u00e1rio e senha s\u00e3o necess\u00e1rios para verificar seu aplicativo.
error.login.fields.manual= O formato do arquivo de sequ\u00eancia de login \u00e9 inv\u00e1lido. Somente a extens\u00e3o do arquivo Config \u00e9 suportada.
error.login.fields.empty.manual = Um arquivo de sequ\u00eancia de login \u00e9 necess\u00e1rio para verificar seu aplicativo.
error.no.creds=Necess\u00e1rio. \u00c9 poss\u00edvel incluir credenciais do HCL AppScan on Cloud na <a target="_blank" href="{0}">p\u00e1gina Credenciais</a>. 
error.no.creds.ase=Necess\u00e1rio. \u00c9 poss\u00edvel incluir credenciais do HCL AppScan Enterprise na <a target="_blank" href="{0}">p\u00e1gina Credenciais</a>.
error.running.scan=Falha ao executar a varredura de seguran\u00e7a: {0}
error.token.expired=N\u00e3o \u00e9 poss\u00edvel autenticar. Verifique suas credenciais na <a target="_blank" href="{0}">p\u00e1gina Credenciais</a>. 
error.noncompliant.issues=O resultado da varredura cont\u00e9m problemas n\u00e3o compat\u00edveis com as pol\u00edticas associadas ao aplicativo selecionado.  
error.threshold.exceeded=O n\u00famero de resultados de seguran\u00e7a excede o limite especificado.
error.threshold.invalid=Entrada inv\u00e1lida. Insira um valor de n\u00famero inteiro.
error.malformed.url=URL malformada {0}.
error.server.unavailable=O plugin AppScan encontrou um erro inesperado ao conectar-se ao AppScan na Nuvem.
error.mobile.analyzer=Entrada incorreta do usu\u00e1rio. A tecnologia legada do Mobile Analyzer n\u00e3o \u00e9 mais suportada, recomendamos usar nossa varredura do Static Analyzer para aplicativos m\u00f3veis.
error.presence.AppScan360= A presen\u00e7a est\u00e1 dispon\u00edvel apenas no AppScan on Cloud.
warning.allow.intervention.AppScan360= Configura\u00e7\u00f5es incorretas de varredura: a interven\u00e7\u00e3o est\u00e1 dispon\u00edvel apenas no AppScan on Cloud.
error.sca.AppScan360= A tarefa do HCL AppScan falhou: a An\u00e1lise de composi\u00e7\u00e3o de software (SCA) est\u00e1 dispon\u00edvel apenas no AppScan on Cloud.
error.sca.ui= A An\u00e1lise de Composi\u00e7\u00e3o de Software est\u00e1 dispon\u00edvel apenas no AppScan on Cloud.
error.allow.intervention.ui = A interven\u00e7\u00e3o de varredura est\u00e1 dispon\u00edvel apenas no AppScan on Cloud
error.include.sca.ui= A inclus\u00e3o de SCA est\u00e1 dispon\u00edvel apenas no AppScan on Cloud.
error.asoc.certificates.ui = A permiss\u00e3o de conex\u00f5es n\u00e3o confi\u00e1veis \u200b\u200bn\u00e3o se aplica ao AppScan on Cloud.
warning.asoc.certificates = A permiss\u00e3o de conex\u00f5es n\u00e3o confi\u00e1veis \u200b\u200bn\u00e3o se aplica a esta conex\u00e3o de servi\u00e7o.
error.application.empty.ui = A lista de aplicativos est\u00e1 vazia. Verifique as credenciais para a conex\u00e3o de servi\u00e7o.
error.url.validation.ui = A menos que seja uma rede privada, verifique seu dom\u00ednio.
error.url.validation = Ocorreu um erro ao validar a URL inicial: {0}.
error.active.subscription.validation = Voc\u00ea n\u00e3o tem uma assinatura {0} v\u00e1lida.
error.active.subscription.validation.ui = Voc\u00ea n\u00e3o tem uma assinatura para o tipo de varredura selecionado.
error.sca.AppScan360.ui= A An\u00e1lise de Composi\u00e7\u00e3o de Software est\u00e1 dispon\u00edvel apenas no AppScan on Cloud.
warning.sca.ui= Para verificar arquivos de c\u00f3digo aberto, use o tipo de varredura An\u00e1lise de Composi\u00e7\u00e3o de Software (SCA).
warning.sca= O AppScan on Cloud (ASoC) agora executa an\u00e1lises SAST e SCA como varreduras separadas. Para executar uma varredura somente de c\u00f3digo aberto, use o tipo An\u00e1lise de Composi\u00e7\u00e3o de Software (SCA).
warning.include.sca.AppScan360= Apenas a varredura SAST est\u00e1 sendo executada. O SCA est\u00e1 dispon\u00edvel apenas com o AppScan on Cloud e n\u00e3o est\u00e1 inclu\u00eddo neste trabalho.
error.invalid.format.include.sca = A varredura SCA requer um arquivo IRX. Forne\u00e7a o caminho para um arquivo IRX v\u00e1lido para prosseguir.
warning.sca.subscription = Apenas a execu\u00e7\u00e3o da varredura SAST ocorre, pois a varredura SCA n\u00e3o est\u00e1 presente nas assinaturas ativas.
error.invalid.scan.id = Isso pode ocorrer devido a caracteres incorretos na ID da varredura, uma ID de varredura de outra organiza\u00e7\u00e3o ou direitos de acesso insuficientes. Verifique e tente novamente.
error.invalid.scan.id.application = O aplicativo selecionado n\u00e3o corresponde ao aplicativo associado ao ID de varredura inserido. Verifique e selecione o aplicativo correto.
error.invalid.scan.id.scan.type = O tipo de varredura selecionado difere do tipo de varredura do ID inserido. Certifique-se de que o tipo de varredura corresponda ao associado \u00e0 ID.
error.invalid.scan.id.git.repo = As varreduras do reposit\u00f3rio Git n\u00e3o s\u00e3o suportadas para novas varreduras SAST via CI/CD.
error.invalid.scan.id.ui = O Scan ID inserido n\u00e3o corresponde ao aplicativo e \u00e0 tecnologia selecionados. Recupere a ID correta do AppScan on Cloud/AppScan 360\u00b0 Server.
warning.personal.scan.rescan = O Personal Scan n\u00e3o \u00e9 aplic\u00e1vel para nova varredura.
error.empty.scan.id = O valor do ID de varredura est\u00e1 vazio. Verifique e tente novamente.


analysis.running=Executando an\u00e1lise de seguran\u00e7a...
authentication.success=Autenticado com \u00eaxito.
authentication.failed=N\u00e3o \u00e9 poss\u00edvel autenticar no servi\u00e7o.
need.api.key=Precisa de um ID/Segredo de chave API? Crie um <a target="_blank" href="{0}">aqui</a>
need_ase_api_doc=\u00c9 necess\u00e1rio gerar segredo e ID da chave. <a target="_blank" href="{0}"> Como obter minhas credenciais?</a>
logs.link=O trabalho {0} foi iniciado com sucesso. Estat\u00edsticas do Scan Job: {1}
check.server=Verifique {0} para obter os resultados da varredura.

label.asoc=Credenciais do HCL AppScan on Cloud
label.ase =Credenciais do HCL AppScan Enterprise
label.build.step=Executar teste de seguran\u00e7a
label.asebuild.step=Executar teste de seguran\u00e7a do AppScan Enterprise
label.results={0} resultados
label.results.trend=Tend\u00eancia de an\u00e1lise de seguran\u00e7a
label.total=Total
label.critical=Cr\u00edtico
label.high=Alta
label.medium=M\u00e9dia
label.low=Baixa
label.latest.report=Relat\u00f3rio {0} mais recente
label.running=Executando varredura {0}...
label.ase.homepage=AppScan Enterprise (ASE)
label.ase.application=AppScan Enterprise (ASE)
label.asoc.homepage=AppScan on Cloud (ASoC)
label.appscan360.homepage=AppScan 360\u00b0

option.staging=Preparando
option.production=Produ\u00e7\u00e3o

option.nooptimization=Sem otimiza\u00e7\u00e3o
option.fast=R\u00e1pido
option.faster=Mais r\u00e1pido
option.fastest=O mais r\u00e1pido
