#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017,2020, 2024, 2025.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE

error.checking.results=Beim \u00dcberpr\u00fcfen der Analyseergebnisse ist ein Fehler aufgetreten. Der Status der Analyse ist {0}.
error.invalid.template.file=Ung\u00fcltige Scanvorlagendatei.
error.invalid.login.sequence.file= Ung\u00fcltige Anmeldesequenzdatei.
error.login.fields.automatic= Benutzername und Kennwort sind zum Scannen der Anwendung erforderlich.
error.login.fields.manual= Das Format der Anmeldesequenzdatei ist ung\u00fcltig. Nur die Dateierweiterung "Config" wird unterst\u00fctzt.
error.login.fields.empty.manual = Eine Anmeldesequenzdatei ist zum Scannen der Anwendung erforderlich.
error.no.creds=Erforderlich. Sie k\u00f6nnen HCL AppScan on Cloud-Berechtigungsnachweise auf der <a target="_blank" href="{0}">Seite ''Berechtigungsnachweise''</a> hinzuf\u00fcgen. 
error.no.creds.ase=Erforderlich. Sie k\u00f6nnen HCL AppScan Enterprise-Berechtigungsnachweise auf der <a target="_blank" href="{0}">Seite ''Berechtigungsnachweise''</a> hinzuf\u00fcgen.
error.running.scan=Der Sicherheitsscan konnte nicht ausgef\u00fchrt werden: {0}
error.token.expired=Authentifizierung nicht m\u00f6glich. \u00dcberpr\u00fcfen Sie Ihre Berechtigungsnachweise auf der <a target="_blank" href="{0}">Seite ''Berechtigungsnachweise''</a>. 
error.noncompliant.issues=Das Scan-Ergebnis enth\u00e4lt nicht konforme Probleme in Bezug auf die mit der ausgew\u00e4hlten Anwendung verkn\u00fcpften Richtlinien.  
error.threshold.exceeded=Die Anzahl der Sicherheitsergebnisse hat den angegebenen Schwellenwert \u00fcberschritten.
error.threshold.invalid=Ung\u00fcltiger Eintrag. Geben Sie einen ganzzahligen Wert ein.
error.malformed.url=Fehlerhaftes URL-Format {0}.
error.server.unavailable=Im AppScan-Plug-in ist ein unerwarteter Fehler beim Verbinden mit AppScan on Cloud aufgetreten.
error.mobile.analyzer=Falsche Benutzereingabe. Die \u00e4ltere Mobile Analyzer-Technologie wird nicht mehr unterst\u00fctzt. Wir empfehlen, unsere Static Analyzer-Scanfunktion f\u00fcr mobile Anwendungen zu verwenden.
error.presence.AppScan360= Presence ist nur in AppScan on Cloud verf\u00fcgbar.
warning.allow.intervention.AppScan360= Falsche Scaneinstellungen: Eingriff ist nur in AppScan on Cloud verf\u00fcgbar.
error.sca.AppScan360= HCL AppScan-Aufgabe fehlgeschlagen: Software Composition Analysis (SCA) ist nur in AppScan on Cloud verf\u00fcgbar.
error.sca.ui= Software Composition Analysis ist nur in AppScan on Cloud verf\u00fcgbar.
error.allow.intervention.ui = Scaneingriff ist nur in AppScan on Cloud verf\u00fcgbar
error.include.sca.ui= "SCA einschlie\u00dfen" ist nur in AppScan on Cloud verf\u00fcgbar.
error.asoc.certificates.ui = Das Zulassen nicht vertrauensw\u00fcrdiger Verbindungen ist f\u00fcr AppScan on Cloud nicht anwendbar.
warning.asoc.certificates = Das Zulassen nicht vertrauensw\u00fcrdiger Verbindungen wurde nicht auf diese Serviceverbindung angewendet.
error.application.empty.ui = Anwendungsliste ist leer. Pr\u00fcfen Sie die Berechtigungsnachweise f\u00fcr die Serviceverbindung. 
error.invalid.domain.ASoC = Sofern es sich nicht um ein privates Netzwerk handelt, \u00fcberpr\u00fcfen Sie bitte Ihre Domain.
error.invalid.domain.AppScan360 = Diese Domain ist nicht in der Liste der zugelassenen Domains enthalten.
error.url.validation = Beim Validieren der Start-URL ist ein Fehler aufgetreten: {0}.
error.active.subscription.validation = Sie besitzen kein g\u00fcltiges {0}-Abonnement.
error.active.subscription.validation.ui = Sie besitzen kein Abonnement f\u00fcr den ausgew\u00e4hlten Scantyp.
error.sca.AppScan360.ui= Software Composition Analysis ist nur in AppScan on Cloud verf\u00fcgbar.
warning.sca.ui= Um Open-Source-Dateien zu scannen, verwenden Sie den Scantyp Software Composition Analysis (SCA).
warning.sca= AppScan on Cloud (ASoC) f\u00fchrt SAST- und SCA-Analysen jetzt als separate Scans aus. Um den Scan nur f\u00fcr Open Source auszuf\u00fchren, verwenden Sie den Scantyp Software Composition Analysis (SCA).
warning.include.sca.AppScan360= Derzeit wird nur der SAST-Scan ausgef\u00fchrt. SCA ist nur mit AppScan on Cloud verf\u00fcgbar und nicht Teil dieses Jobs.
error.invalid.format.include.sca = F\u00fcr SCA-Scan ist eine IRX-Datei erforderlich. Geben Sie den Pfad zu einer g\u00fcltigen IRX-Datei an, um fortzufahren.
warning.sca.subscription = Nur der SAST-Scan wird ausgef\u00fchrt, da der SCA-Scan in den aktiven Abonnements nicht enthalten ist.
error.invalid.scan.id = Ung\u00fcltige Scan-ID: Vergewissern Sie sich, dass sie zu Ihrem Unternehmen geh\u00f6rt und dem ausgew\u00e4hlten Scantyp entspricht.
error.invalid.scan.id.application = Anwendung stimmt nicht \u00fcberein: Vergewissern Sie sich, dass die ausgew\u00e4hlte Anwendung mit der der Scan-ID zugeordneten Anwendung \u00fcbereinstimmt.
error.invalid.scan.id.git.repo = Git-Repository-Scans werden f\u00fcr erneute SAST-Scans \u00fcber CI/CD nicht unterst\u00fctzt.
warning.personal.scan.rescan = Pers\u00f6nlicher Scan ist f\u00fcr erneuten Scan nicht anwendbar.
error.empty.scan.id = Scan-ID-Wert ist leer. \u00dcberpr\u00fcfen Sie den Wert und wiederholen Sie den Vorgang.
warning.empty.execution.id = Die Basis-Ausf\u00fchrungs-ID fehlt. Da der Scan auf inkrementell eingestellt ist, wird standardm\u00e4\u00dfig ein vollst\u00e4ndiger Scan durchgef\u00fchrt.
error.scan.id.validation.rescan.allowed = Aufgrund betrieblicher Einschr\u00e4nkungen ist ein erneuter Scan nicht zul\u00e4ssig.
error.scan.id.validation.status = Der ausgew\u00e4hlte Scan befindet sich im Status {0}. Erneute Scans k\u00f6nnen nur durchgef\u00fchrt werden, wenn der Scan im Zustand "Bereit", "Angehalten" oder "Fehlgeschlagen" ist.
error.invalid.scan.id.ui = Ung\u00fcltige Scan-ID oder Unstimmigkeit im Scantyp.
error.invalid.scan.id.application.ui = Scan-ID stimmt nicht mit der ausgew\u00e4hlten Anwendung \u00fcberein.
error.invalid.scan.id.git.repo.ui = Git Repo-Scans werden f\u00fcr erneute SAST-Scans nicht unterst\u00fctzt.
error.invalid.scan.id.rescan.allowed.ui = Erneutes Scannen durch Administratorrichtlinie deaktiviert.
error.base.scan.empty.ui = Ung\u00fcltige Scan-ID. Bitte geben Sie eine g\u00fcltige Scan-ID ein, um einen Basisscan auszuw\u00e4hlen.
error.token.authentication = Ihre Schl\u00fcssel-ID und Ihr Geheimnis konnten nicht validiert werden. Bitte \u00fcberpr\u00fcfen Sie dies und versuchen Sie es erneut.
error.scan.status.unstable= Eine Scan-Ausf\u00fchrung ist fehlgeschlagen. Die Ergebnisse des erfolgreichen Scans finden Sie auf der \u00dcbersichtsseite des Builds.
error.file.type.invalid= Ung\u00fcltiger Dateityp. Nur {0}-Dateien werden unterst\u00fctzt.
error.target.empty= Das Ziel ist leer. Bitte geben Sie eine g\u00fcltige Ziel-URL an.
error.invalid.url.connection= Verbindung zur URL nicht m\u00f6glich.

analysis.running=Sicherheitsanalyse wird ausgef\u00fchrt...
authentication.success=Erfolgreich authentifiziert.
authentication.failed=Authentifizierung zum Service nicht m\u00f6glich.
need.api.key=Sie ben\u00f6tigen API-Schl\u00fcssel-ID/geheimen Schl\u00fcssel? Klicken Sie <a target="_blank" href="{0}">hier</a> zum Erstellen
need_ase_api_doc=Schl\u00fcssel-ID und geheimer Schl\u00fcssel m\u00fcssen generiert werden. <a target="_blank" href="{0}"> Wie bekomme ich meine Anmeldeinformationen?</a>
logs.link=Job {0} erfolgreich gestartet. Scanjobstatistiken: {1}
check.server=Ihre Scanergebnisse finden Sie hier: {0}.
fail.build.check= \u00dcberpr\u00fcfung auf Build-Fehler basierend auf der Scan-Konfiguration ...

label.asoc=Anmeldedaten f\u00fcr HCL AppScan on Cloud/HCL AppScan 360\u00b0
label.ase =HCL AppScan Enterprise-Anmeldeinformationen
label.build.step=Sicherheitstest f\u00fcr AppScan on Cloud/AppScan 360\u00b0 ausf\u00fchren
label.asebuild.step=AppScan Enterprise Sicherheitstest ausf\u00fchren
label.results={0} Ergebnisse
label.results.trend=Sicherheitsanalysentrend
label.total=Gesamt
label.critical=Kritisch
label.high=Hoch
label.medium=Mittel
label.low=Niedrig
label.latest.report=Letzte {0} Berichte
label.running=Scan {0} wird ausgef\u00fchrt...
label.ase.homepage=AppScan Enterprise (ASE)
label.ase.application=AppScan Enterprise (ASE)
label.asoc.homepage=AppScan on Cloud (ASoC)
label.appscan360.homepage=AppScan 360\u00b0

option.staging=Staging
option.production=Produktion

option.nooptimization=Keine Optimierung
option.fast=Schnell
option.faster=Schneller
option.fastest=Am schnellsten
