#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017,2020, 2024, 2025.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE

error.checking.results=\ubd84\uc11d \uacb0\uacfc\ub97c \ud655\uc778\ud558\ub294 \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4. \ubd84\uc11d \uc0c1\ud0dc\ub294 {0}\uc785\ub2c8\ub2e4.
error.invalid.template.file=\uc2a4\uce94 \ud15c\ud50c\ub9ac\ud2b8 \ud30c\uc77c\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.invalid.login.sequence.file= \ub85c\uadf8\uc778 \uc2dc\ud000\uc2a4 \ud30c\uc77c\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.login.fields.automatic= \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc2a4\uce94\ud558\ub824\uba74 \uc0ac\uc6a9\uc790 \uc774\ub984\uacfc \ube44\ubc00\ubc88\ud638\uac00 \ud544\uc694\ud569\ub2c8\ub2e4.
error.login.fields.manual= \ub85c\uadf8\uc778 \uc2dc\ud000\uc2a4 \ud30c\uc77c \ud615\uc2dd\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uad6c\uc131 \ud30c\uc77c \ud655\uc7a5\uc790\ub9cc \uc9c0\uc6d0\ub429\ub2c8\ub2e4.
error.login.fields.empty.manual = \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc2a4\uce94\ud558\ub824\uba74 \ub85c\uadf8\uc778 \uc2dc\ud000\uc2a4 \ud30c\uc77c\uc774 \ud544\uc694\ud569\ub2c8\ub2e4.
error.no.creds=\ud544\uc218\uc785\ub2c8\ub2e4. <a target="_blank" href="{0}">\uc2e0\uc784 \uc815\ubcf4 \ud398\uc774\uc9c0</a>\uc5d0\uc11c HCL AppScan on Cloud \uc2e0\uc784 \uc815\ubcf4\ub97c \ucd94\uac00\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. 
error.no.creds.ase=\ud544\uc218\uc785\ub2c8\ub2e4. <a target="_blank" href="{0}">\uc2e0\uc784 \uc815\ubcf4 \ud398\uc774\uc9c0</a>\uc5d0\uc11c HCL AppScan Enterprise \uc2e0\uc784 \uc815\ubcf4\ub97c \ucd94\uac00\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
error.running.scan=\ubcf4\uc548 \uc2a4\uce94 {0}\uc758 \uc2e4\ud589\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4.
error.token.expired=\uc778\uc99d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. <a target="_blank" href="{0}">\uc2e0\uc784 \uc815\ubcf4 \ud398\uc774\uc9c0</a>\uc5d0\uc11c \uc2e0\uc784 \uc815\ubcf4\ub97c \ud655\uc778\ud558\uc2ed\uc2dc\uc624. 
error.noncompliant.issues=\uc2a4\uce94 \uacb0\uacfc\uc5d0 \uc120\ud0dd\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uacfc \uad00\ub828\ub41c \uc815\ucc45\uc744 \uc900\uc218\ud558\uc9c0 \uc54a\ub294 \ubb38\uc81c\uac00 \ud3ec\ud568\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.  
error.threshold.exceeded=\ubcf4\uc548 \uacb0\uacfc \uc218\uac00 \uc9c0\uc815\ub41c \uc784\uacc4\uac12\uc744 \ucd08\uacfc\ud569\ub2c8\ub2e4.
error.threshold.invalid=\uc785\ub825\uc774 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc815\uc218 \uac12\uc744 \uc785\ub825\ud558\uc2ed\uc2dc\uc624.
error.malformed.url=\uc798\ubabb \ud615\uc131\ub41c URL {0}
error.server.unavailable=AppScan on Cloud\uc5d0 \uc5f0\uacb0\ud558\ub294 \ub3d9\uc548 AppScan \ud50c\ub7ec\uadf8\uc778\uc5d0\uc11c \uc608\uae30\uce58 \uc54a\uc740 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
error.mobile.analyzer=\uc0ac\uc6a9\uc790 \uc785\ub825\uc774 \uc798\ubabb\ub428: \ub808\uac70\uc2dc Mobile Analyzer \uae30\uc220\uc740 \ub354 \uc774\uc0c1 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ubaa8\ubc14\uc77c \uc560\ud50c\ub9ac\ucf00\uc774\uc158 \uc2a4\uce94\uc740 Static Analyzer\ub97c \uc0ac\uc6a9\ud558\ub294 \uac83\uc774 \uc88b\uc2b5\ub2c8\ub2e4.
error.presence.AppScan360= Presence\ub294 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
warning.allow.intervention.AppScan360= \uc2a4\uce94 \uc124\uc815\uc774 \uc798\ubabb\ub428: \uac1c\uc785\uc740 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
error.sca.AppScan360= HCL AppScan \uc791\uc5c5\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4. SCA(Software Composition Analysis)\ub294 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
error.sca.ui= SCA(Software Composition Analysis)\ub294 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
error.allow.intervention.ui = \uc2a4\uce94 \uac1c\uc785\uc740 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc74c
error.include.sca.ui= SCA \ud3ec\ud568\uc740 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
error.asoc.certificates.ui = \uc2e0\ub8b0\ud560 \uc218 \uc5c6\ub294 \uc5f0\uacb0 \ud5c8\uc6a9\uc740 AppScan on Cloud\uc5d0 \uc801\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
warning.asoc.certificates = \uc2e0\ub8b0\ud560 \uc218 \uc5c6\ub294 \uc5f0\uacb0 \ud5c8\uc6a9\uc740 \uc774 \uc11c\ube44\uc2a4 \uc5f0\uacb0\uc5d0 \uc801\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.application.empty.ui = \uc560\ud50c\ub9ac\ucf00\uc774\uc158 \ubaa9\ub85d\uc774 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \uc11c\ube44\uc2a4 \uc5f0\uacb0\uc744 \uc704\ud55c \uc790\uaca9 \uc99d\uba85\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624. 
error.invalid.domain.ASoC = \ube44\uacf5\uac1c \ub124\ud2b8\uc6cc\ud06c\uac00 \uc544\ub2c8\ub77c\uba74 \ub3c4\uba54\uc778\uc744 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
error.invalid.domain.AppScan360 = \uc774 \ub3c4\uba54\uc778\uc740 \ud5c8\uc6a9\ub41c \ub3c4\uba54\uc778 \ubaa9\ub85d\uc5d0 \uc5c6\uc2b5\ub2c8\ub2e4.
error.url.validation = {0} \uc2dc\uc791 URL \uc720\ud6a8\uc131 \uac80\uc99d \uc911\uc5d0 \uc624\ub958\uac00 \ubc1c\uc0dd\ud588\uc2b5\ub2c8\ub2e4.
error.active.subscription.validation = \uc720\ud6a8\ud55c {0} \uad6c\ub3c5\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
error.active.subscription.validation.ui = \uc120\ud0dd\ud55c \uc2a4\uce94 \uc720\ud615\uc5d0 \ub300\ud55c \uad6c\ub3c5\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
error.sca.AppScan360.ui= SCA(Software Composition Analysis)\ub294 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
warning.sca.ui= \uac1c\ubc29\ud615 \uc18c\uc2a4 \ud30c\uc77c\uc744 \uc2a4\uce94\ud558\ub824\uba74 SCA(Software Composition Analysis) \uc2a4\uce94 \uc720\ud615\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
warning.sca= ASoC(AppScan on Cloud)\ub294 \ud604\uc7ac SAST \ubc0f SCA \ubd84\uc11d\uc744 \ubcc4\ub3c4\uc758 \uc2a4\uce94\uc73c\ub85c \uc218\ud589\ud569\ub2c8\ub2e4. \uac1c\ubc29\ud615 \uc18c\uc2a4 \uc804\uc6a9 \uc2a4\uce94\uc744 \uc2e4\ud589\ud558\ub824\uba74 SCA(Software Composition Analysis) \uc2a4\uce94 \uc720\ud615\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
warning.include.sca.AppScan360= SAST \uc2a4\uce94\ub9cc \uc2e4\ud589\ub418\uace0 \uc788\uc2b5\ub2c8\ub2e4. SCA\ub294 AppScan on Cloud\uc5d0\uc11c\ub9cc \uc0ac\uc6a9 \uac00\ub2a5\ud558\uae30 \ub54c\ubb38\uc5d0 \uc774 \uc791\uc5c5\uc5d0 \ud3ec\ud568\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.invalid.format.include.sca = SCA \uc2a4\uce94\uc5d0\ub294 IRX \ud30c\uc77c\uc774 \ud544\uc694\ud569\ub2c8\ub2e4. \ucc98\ub9ac\ud560 IRX \ud30c\uc77c\uc758 \uc720\ud6a8\ud55c \uacbd\ub85c\ub97c \uc81c\uacf5\ud558\uc2ed\uc2dc\uc624.
warning.sca.subscription = SAST \uc2a4\uce94 \uc2e4\ud589\ub9cc SCA \uc2a4\uce94\uc73c\ub85c \uc218\ud589\ud558\ub294 \uacbd\uc6b0 \ud65c\uc131 \uad6c\ub3c5 \uc544\ub798\uc5d0 \ud45c\uc2dc\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.invalid.scan.id = \uc62c\ubc14\ub974\uc9c0 \uc54a\uc740 \uc2a4\uce94 ID: \ud574\ub2f9 ID\uac00 \uc870\uc9c1\uc5d0 \uc18d\ud574 \uc788\uace0 \uc120\ud0dd\ud55c \uc2a4\uce94 \uc720\ud615\uacfc \uc77c\uce58\ud558\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
error.invalid.scan.id.application = \uc560\ud50c\ub9ac\ucf00\uc774\uc158 \ubd88\uc77c\uce58: \uc120\ud0dd\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc774 \uc2a4\uce94 ID\uc758 \uad00\ub828 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uacfc \uc77c\uce58\ud558\ub294\uc9c0 \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
error.invalid.scan.id.git.repo = CI/CD\ub97c \ud1b5\ud55c SAST \uc7ac\uc2a4\uce94\uc758 \uacbd\uc6b0 Git \ub9ac\ud3ec\uc9c0\ud1a0\ub9ac \uc2a4\uce94\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
warning.personal.scan.rescan = \uac1c\uc778 \uc2a4\uce94\uc740 \uc7ac\uc2a4\uce94\uc5d0 \uc801\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.empty.scan.id = \uc2a4\uce94 ID \uac12\uc774 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \ud655\uc778 \ud6c4 \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uc2ed\uc2dc\uc624.
warning.empty.execution.id = \uae30\ubcf8 \uc2e4\ud589 ID\uac00 \ub204\ub77d\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc2a4\uce94\uc774 \uc99d\ubd84\uc73c\ub85c \uc124\uc815\ub418\uc5b4 \uc788\uae30 \ub54c\ubb38\uc5d0 \uc804\uccb4 \uc2a4\uce94\uc774 \uae30\ubcf8\uac12\uc785\ub2c8\ub2e4.
error.scan.id.validation.rescan.allowed = \uc870\uc9c1 \uc81c\ud55c \uc0ac\ud56d\uc73c\ub85c \uc778\ud574 \uc7ac\uc2a4\uce94\uc740 \ud5c8\uc6a9\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.scan.id.validation.status = \uc120\ud0dd\ud55c \uc2a4\uce94\uc758 \uc0c1\ud0dc\uac00 {0}\uc785\ub2c8\ub2e4. \uc7ac\uc2a4\uce94\uc740 \uc2a4\uce94 \uc0c1\ud0dc\uac00 \uc900\ube44, \uc77c\uc9c0 \uc911\uc9c0 \ub610\ub294 \uc2e4\ud328\uc77c \ub54c\ub9cc \uc218\ud589\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
error.invalid.scan.id.ui = \uc2a4\uce94 ID\uac00 \uc62c\ubc14\ub974\uc9c0 \uc54a\uac70\ub098 \uc2a4\uce94 \uc720\ud615\uc774 \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.invalid.scan.id.application.ui = \uc2a4\uce94 ID\uac00 \uc120\ud0dd\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uacfc \uc77c\uce58\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.invalid.scan.id.git.repo.ui = SAST \uc7ac\uc2a4\uce94\uc758 \uacbd\uc6b0 Git \ub9ac\ud3ec\uc9c0\ud1a0\ub9ac \uc2a4\uce94\uc774 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
error.invalid.scan.id.rescan.allowed.ui = \uad00\ub9ac \uc815\ucc45\uc5d0 \uc758\ud574 \uc7ac\uc2a4\uce94\uc774 \ube44\ud65c\uc131\ud654\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
error.base.scan.empty.ui = \uc2a4\uce94 ID\uac00 \uc62c\ubc14\ub974\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uae30\ubcf8 \uc2a4\uce94\uc744 \uc120\ud0dd\ud558\ub824\uba74 \uc62c\ubc14\ub978 \uc2a4\uce94 ID\ub97c \uc785\ub825\ud558\uc2ed\uc2dc\uc624.
error.token.authentication = \ud0a4 ID\uc640 \ubcf8\uc778\ud655\uc778\uc815\ubcf4\ub97c \uac80\uc99d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ud655\uc778 \ud6c4 \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uc2ed\uc2dc\uc624.
error.scan.status.unstable= \ub2e8\uc77c \uc2a4\uce94 \uc2e4\ud589\uc5d0 \uc2e4\ud328\ud588\uc2b5\ub2c8\ub2e4. \uc2a4\uce94 \uc131\uacf5 \uacb0\uacfc\ub294 \ube4c\ub4dc \uc694\uc57d \ud398\uc774\uc9c0\ub97c \ucc38\uc870\ud558\uc2ed\uc2dc\uc624.
error.file.type.invalid= \uc798\ubabb\ub41c \ud30c\uc77c \uc720\ud615\uc785\ub2c8\ub2e4. {0} \ud30c\uc77c\ub9cc \uc9c0\uc6d0\ub429\ub2c8\ub2e4.
error.target.empty= \ub300\uc0c1\uc774 \ube44\uc5b4 \uc788\uc2b5\ub2c8\ub2e4. \uc62c\ubc14\ub978 \ub300\uc0c1 URL\uc744 \uc81c\uacf5\ud558\uc2ed\uc2dc\uc624.
error.invalid.url.connection= URL\uc5d0 \uc5f0\uacb0\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.

analysis.running=\ubcf4\uc548 \ubd84\uc11d \uc2e4\ud589 \uc911...
authentication.success=\uc778\uc99d\uc774 \uc644\ub8cc\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
authentication.failed=\uc11c\ube44\uc2a4\uc5d0 \uc778\uc99d\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
need.api.key=API \ud0a4 ID/\ubcf8\uc778\ud655\uc778\uc815\ubcf4\uac00 \ud544\uc694\ud569\ub2c8\uae4c? <a target="_blank" href="{0}">\uc5ec\uae30\uc11c</a> \uc774\ub97c \uc791\uc131\ud558\uc2ed\uc2dc\uc624.
need_ase_api_doc=\ud0a4 ID\uc640 \ubcf8\uc778\ud655\uc778\uc815\ubcf4\ub97c \uc0dd\uc131\ud574\uc57c \ud569\ub2c8\ub2e4. <a target="_blank" href="{0}"> \ub0b4 \uc2e0\uc784 \uc815\ubcf4\ub97c \ud655\uc778\ud558\ub824\uba74 \uc5b4\ub5bb\uac8c \ud574\uc57c \ud569\ub2c8\uae4c?</a>
logs.link={0} \uc791\uc5c5\uc774 \uc2dc\uc791\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc2a4\uce94 \uc791\uc5c5 \ud1b5\uacc4: {1}
check.server=\uc2a4\uce94 \uacb0\uacfc\ub294 {0}\uc744(\ub97c) \ud655\uc778\ud558\uc2ed\uc2dc\uc624.
fail.build.check= \uc2a4\uce94 \uad6c\uc131\uc744 \uae30\ubc18\uc73c\ub85c \ube4c\ub4dc \uc2e4\ud328 \ud655\uc778 \uc911...

label.asoc=HCL AppScan on Cloud/HCL AppScan 360\u00b0 \uc2e0\uc784 \uc815\ubcf4
label.ase =HCL AppScan Enterprise \uc2e0\uc784 \uc815\ubcf4
label.build.step=AppScan on Cloud/AppScan 360\u00b0 \ubcf4\uc548 \ud14c\uc2a4\ud2b8 \uc2e4\ud589
label.asebuild.step=AppScan Enterprise \ubcf4\uc548 \ud14c\uc2a4\ud2b8 \uc2e4\ud589
label.results={0}\uac1c\uc758 \uacb0\uacfc
label.results.trend=\ubcf4\uc548 \ubd84\uc11d \uc0c1\ud0dc\ub3d9\ud5a5
label.total=\ucd1d\uacc4
label.critical=\uc911\uc694
label.high=\ub192\uc74c
label.medium=\uc911\uac04
label.low=\ub0ae\uc74c
label.latest.report=\ucd5c\uc2e0 {0} \ubcf4\uace0\uc11c
label.running={0} \uc2a4\uce94 \uc2e4\ud589 \uc911...
label.ase.homepage=ASE(AppScan Enterprise)
label.ase.application=ASE(AppScan Enterprise)
label.asoc.homepage=ASoC(AppScan on Cloud)
label.appscan360.homepage=AppScan 360\u00b0

option.staging=\uc2a4\ud14c\uc774\uc9d5
option.production=\ud504\ub85c\ub355\uc158

option.nooptimization=\ucd5c\uc801\ud654 \uc5c6\uc74c
option.fast=\ube60\ub974\uac8c
option.faster=\ub354 \ube60\ub974\uac8c
option.fastest=\uac00\uc7a5 \ube60\ub974\uac8c
