#
# \u00a9 Copyright IBM Corporation 2016.
# \u00a9 Copyright HCL Technologies Ltd. 2017,2020, 2024.
# LICENSE: Apache License, Version 2.0 https://www.apache.org/licenses/LICENSE-2.0
#
# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE

error.checking.results=Une erreur s''est produite lors de la v\u00e9rification des r\u00e9sultats d''analyse. L''\u00e9tat de l''analyse est {0}.
error.invalid.template.file=Mod\u00e8le de fichier d''examen non valide.
error.invalid.login.sequence.file= Fichier de s\u00e9quence de connexion non valide.
error.login.fields.automatic= Le nom d'utilisateur et le mot de passe sont requis pour l'examen de votre application.
error.login.fields.manual= Le format du fichier de s\u00e9quence de connexion n'est pas valide. Seule l'extension du fichier de configuration est prise en charge.
error.login.fields.empty.manual = Un fichier de s\u00e9quence de connexion est requis pour l'examen de votre application.
error.no.creds=Requises. Vous pouvez entrer les donn\u00e9es d''identification HCL AppScan on Cloud sur la <a target="_blank" href="{0}">page Donn\u00e9es d''identification</a>. 
error.no.creds.ase=Requises. Vous pouvez entrer les donn\u00e9es d''identification HCL AppScan Enterprise sur la <a target="_blank" href="{0}">page Donn\u00e9es d''identification</a>.
error.running.scan=Echec de l''examen de s\u00e9curit\u00e9 : {0}
error.token.expired=Authentification impossible. V\u00e9rifiez vos donn\u00e9es d''identification sur la <a target="_blank" href="{0}">page Donn\u00e9es d''identification</a>. 
error.noncompliant.issues=Les r\u00e9sultats d'examen pr\u00e9sentent des probl\u00e8mes de non-conformit\u00e9 relativement aux politiques associ\u00e9es avec l'application s\u00e9lectionn\u00e9e.  
error.threshold.exceeded=Le nombre de r\u00e9sultats de s\u00e9curit\u00e9 d\u00e9passe le seuil d\u00e9fini.
error.threshold.invalid=Entr\u00e9e non valide. Saisissez une valeur de type entier.
error.malformed.url=URL {0} mal form\u00e9e.
error.server.unavailable=Le plug-in AppScan a rencontr\u00e9 une erreur inattendue lors de la connexion \u00e0 AppScan on Cloud.
error.mobile.analyzer=Saisie utilisateur incorrecte. La technologie Mobile Analyzer h\u00e9rit\u00e9e n'est plus prise en charge. Nous vous recommandons d'utiliser notre examen Static Analyzer pour les applications mobiles.
error.presence.AppScan360= Pr\u00e9sence est disponible dans AppScan on Cloud uniquement.
warning.allow.intervention.AppScan360= Param\u00e8tres d'examen incorrects\u00a0: l'intervention est disponible dans AppScan on Cloud uniquement.
error.sca.AppScan360= Echec de la t\u00e2che HCL AppScan\u00a0: Software Composition Analysis (SCA) est disponible dans AppScan on Cloud uniquement.
error.sca.ui= Software Composition Analysis est disponible dans AppScan on Cloud uniquement.
error.allow.intervention.ui = L'intervention d'un examen est disponible dans AppScan on Cloud uniquement
error.include.sca.ui= L'option Inclure SCA est disponible dans AppScan on Cloud uniquement.
error.asoc.certificates.ui = L'autorisation des connexions non approuv\u00e9es ne s'applique pas \u00e0 AppScan on Cloud.
warning.asoc.certificates = L'autorisation des connexions non approuv\u00e9es n'est pas appliqu\u00e9e \u00e0 cette connexion au service.
error.application.empty.ui = La liste des applications est vide. V\u00e9rifiez les donn\u00e9es d'identification pour la connexion au service. 
error.url.validation.ui = A moins qu'il ne s'agisse d'un r\u00e9seau priv\u00e9, v\u00e9rifiez votre domaine.
error.url.validation = Une erreur s''est produite lors de la validation de l''URL de d\u00e9part\u00a0: {0}.
error.active.subscription.validation = Vous ne disposez pas d''un abonnement {0} valide.
error.active.subscription.validation.ui = Vous ne disposez pas d'un abonnement pour le type d'examen s\u00e9lectionn\u00e9.
error.sca.AppScan360.ui= Software Composition Analysis est disponible dans AppScan on Cloud uniquement.
warning.sca.ui= Pour examiner des fichiers open source, utilisez le type d'examen Software Composition Analysis (SCA).
warning.sca= AppScan on Cloud (ASoC) effectue d\u00e9sormais des analyses SAST et SCA en tant qu'examens distincts. Pour ex\u00e9cuter un examen open source uniquement, utilisez le type d'examen Software Composition Analysis (SCA).
warning.include.sca.AppScan360= Seul l'examen SAST est en cours d'ex\u00e9cution. SCA n'est disponible qu'avec AppScan on Cloud et n'est pas inclus dans ce travail.
error.invalid.format.include.sca = L'examen SCA n\u00e9cessite un fichier IRX. Indiquez le chemin d'un fichier IRX valide pour continuer.
warning.sca.subscription = Seule l'ex\u00e9cution de l'examen SAST a lieu, car l'examen SCA n'est pas pr\u00e9sent dans les abonnements actifs.
error.invalid.scan.id = Cela peut se produire en raison de caract\u00e8res incorrects dans l'ID d'examen, d'un ID d'examen provenant d'une autre organisation ou de droits d'acc\u00e8s insuffisants. Proc\u00e9dez \u00e0 une v\u00e9rification et r\u00e9essayez.
error.invalid.scan.id.application = L'application s\u00e9lectionn\u00e9e ne correspond pas \u00e0 l'application associ\u00e9e \u00e0 l'ID d'examen saisi. Proc\u00e9dez \u00e0 une v\u00e9rification et s\u00e9lectionnez l'application correcte.
error.invalid.scan.id.scan.type = Le type d'examen s\u00e9lectionn\u00e9 diff\u00e8re du type d'examen de l'ID d'examen saisi. Assurez-vous que le type d'examen correspond \u00e0 celui associ\u00e9 \u00e0 l'ID d'examen.
error.invalid.scan.id.git.repo = Les examens du r\u00e9f\u00e9rentiel Git ne sont pas pris en charge pour les nouveaux examens SAST via CI/CD.
error.invalid.scan.id.ui = L'ID d'examen saisi ne correspond pas \u00e0 l'application et \u00e0 la technologie s\u00e9lectionn\u00e9es. R\u00e9cup\u00e9rez l'ID correct \u00e0 partir du serveur AppScan on Cloud/AppScan 360\u00b0.
warning.personal.scan.rescan = L'examen personnel ne s'applique pas \u00e0 un nouvel examen.
error.empty.scan.id = La valeur de l'ID d'examen est vide. Proc\u00e9dez \u00e0 une v\u00e9rification et r\u00e9essayez.


analysis.running=Ex\u00e9cution de l''analyse de s\u00e9curit\u00e9...
authentication.success=Authentification r\u00e9ussie.
authentication.failed=Echec de l''authentification aupr\u00e8s du service.
need.api.key=Vous avez besoin d''un secret ou d''un ID de cl\u00e9 d''API ? Cr\u00e9ez-en un <a target="_blank" href="{0}">ici</a>
need_ase_api_doc=Vous devez g\u00e9n\u00e9rer un ID de cl\u00e9 et un secret. <a target="_blank" href="{0}"> Comment r\u00e9cup\u00e9rer mes donn\u00e9es d''identification ?</a>
logs.link=Le travail {0} a d\u00e9marr\u00e9. Statistiques du travail d''examen\u00a0: {1}
check.server=V\u00e9rifiez {0} pour les r\u00e9sultats de votre examen.

label.asoc=Donn\u00e9es d''identification HCL AppScan on Cloud
label.ase =Donn\u00e9es d'identification HCL AppScan Enterprise
label.build.step=Ex\u00e9cuter le test de s\u00e9curit\u00e9
label.asebuild.step=Ex\u00e9cuter le test de s\u00e9curit\u00e9 AppScan Enterprise
label.results={0} R\u00e9sultats
label.results.trend=Tendance de l''analyse de s\u00e9curit\u00e9
label.total=Total
label.critical=Critique
label.high=Elev\u00e9e
label.medium=Moyenne
label.low=Faible
label.latest.report=Dernier rapport {0}
label.running=Ex\u00e9cution de l''examen {0}...
label.ase.homepage=AppScan Enterprise (ASE)
label.ase.application=AppScan Enterprise (ASE)
label.asoc.homepage=AppScan on Cloud (ASoC)
label.appscan360.homepage=AppScan\u00a0360\u00b0

option.staging=Transfert
option.production=Production

option.nooptimization=Sans optimisation
option.fast=Rapide
option.faster=Plus rapide
option.fastest=Le plus rapide
